export interface ContentList {
  id: number;
  title: string;
  text: string;
}

export interface Content {
  id: number;
  text?: string;
  dataFirst: number;
  dataSecond: number;
  contentList: ContentList[];
}
export const circleContent: Content[] = [
  {
    id: 1,
    text: "Наука",
    dataFirst: 1951,
    dataSecond: 2001,
    contentList: [
      {
        id: 1,
        title: "2015",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 2,
        title: "2016",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 3,
        title: "2017 ",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        id: 4,
        title: "2018",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 5,
        title: "2019",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        id: 6,
        title: "2020",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
  {
    id: 2,
    text: "Наука",
    dataFirst: 1952,
    dataSecond: 2022,
    contentList: [
      {
        id: 1,
        title: "2000",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 2,
        title: "2001",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 3,
        title: "2002 ",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        id: 4,
        title: "2003",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 5,
        title: "2004",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 6,
        title: "2005",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },

  {
    id: 3,
    text: "Наука",
    dataFirst: 1953,
    dataSecond: 2023,
    contentList: [
      {
        id: 1,
        title: "2015",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 2,
        title: "2016",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 3,
        title: "2017 ",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        id: 4,
        title: "2018",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 5,
        title: "2019",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        id: 6,
        title: "2020",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
  {
    id: 4,
    text: "Наука",
    dataFirst: 1955,
    dataSecond: 2033,
    contentList: [
      {
        id: 1,
        title: "2011",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 2,
        title: "2022",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 3,
        title: "2033 ",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        id: 4,
        title: "2044",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 5,
        title: "2019",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 6,
        title: "2020",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
  {
    id: 5,
    text: "Наука",
    dataFirst: 1925,
    dataSecond: 2015,
    contentList: [
      {
        id: 1,
        title: "2000",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 2,
        title: "2001",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 3,
        title: "2002 ",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        id: 4,
        title: "2003",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 5,
        title: "2004",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 6,
        title: "2005",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
  {
    id: 6,
    text: "Наука",
    dataFirst: 1987,
    dataSecond: 1999,
    contentList: [
      {
        id: 1,
        title: "2011",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 2,
        title: "2022",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 3,
        title: "2033 ",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        id: 4,
        title: "2044",
        text: "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        id: 5,
        title: "2019",
        text: "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        id: 6,
        title: "2020",
        text: "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
];
